namespace OpenCoursesAdmin.Services.Constants
{
    using System.Collections.Generic;

    public class SurveyQuestions
    {
        public static Dictionary<int, List<string>> AllSurveyQuestions = new Dictionary<int, List<string>>()
        {
            {1, new List<string>()
                {
                    "В каква форма на обучение сте?",
                    "С какво мислите, че могат да бъдат подобрени учебните материали?",
                    "С какво мислите, че могат да бъдат подобрени занятията?",
                    "С какво мислите, че могат да бъдат подобрени проведените занятия?",
                    "Допълнителни коментари и съвети за подобрение на курса",
                    "Какви препоръки можете да дадете за подобряване представянето на лектора?",
                    "Моля, посочете Вашите впечатления и препоръки към екипа за клиентско обслужване на СофтУни.",
                    "Кои ресурси Ви помогнаха най-много при подготовката за изпита?",
                    "Как според Вас може да се разпредели по-добре времето на курса?",
                    "От кой град сте?",
                    "В коя възрастова група спадате?",
                    "Друго",
                    "Коя е Вашата сфера на дейност?",
                    "От къде разбрахте за курса?",
                    "Защо се записахте на курса?"
                }
            },
            {0, new List<string>()
                {
                    "Каква е оценката Ви за курса до момента?",
                    "Каква е оценката Ви за курса като цяло?",
                    "Каква е оценката Ви за учебните материали към курса?",
                    "Каква е оценката Ви за проведените занятия до момента?",
                    "Каква е оценката Ви за представяне на лектора до момента?",
                    "Лекторът съдейства ли с разрешаване на проблеми и отговаря ли на въпросите Ви?",
                    "Лекторът беше ли на разположение по време на курса?",
                    "Как оценявате клиентското обслужване, което получихте от екипа на СофтУни във връзка с навременното информиране и получаването на качествен и изчерпателен",
                    "Как оценявате клиентското обслужване, което получихте от екипа на СофтУни във връзка с навременното информиране и получаването на качествен и изчерпателен отговор на всяко Ваше запитване?",
                    "Какво мислите за продължителността на курса?",
                    "Каква е оценката Ви за проведените занятия по време на курса?",
                    "До колко изпитът в края на курса отговаря на упражненията и наученото в него?",
                    "Каква е оценката Ви от цялостното представяне на лектора?"
                }
            }
        };

        public const string CourseRatingMiddle = "Каква е оценката Ви за курса до момента?";

        public const string TrainerRatingMiddle = "Каква е оценката Ви за представяне на лектора до момента?";

        public const string CourseRatingFinal = "Каква е оценката Ви за курса като цяло?";

        public const string TrainerRatingFinal = "Каква е оценката Ви от цялостното представяне на лектора?";

        //public const string TrainerRatingFinal = "Как бихте оценили лектора?";
    }
}
